Revit 2027 API
DetailCurveArray.Append Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	DetailCurve item
)
Public Overridable Sub Append (
	item As DetailCurve
)
public:
virtual void Append(
	DetailCurve^ item
)
abstract Append :
        item : DetailCurve -> unit
override Append :
        item : DetailCurve -> unit
Parameters
item DetailCurve
See Also
Reference
DetailCurveArray Class
Autodesk.Revit.DB Namespace